Revit 2027 API
ParameterTypeId.ViewScalePulldownMetric Property
 "View Scale"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewScalePulldownMetric { get; }
Public Shared ReadOnly Property ViewScalePulldownMetric As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewScalePulldownMetric {
	ForgeTypeId^ get ();
}
static member ViewScalePulldownMetric : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace